# Built In Failures MEPFabrication Failures Fabrication Part Invalid Insulation Specification Warning Property

Source: https://www.revitapidocs.com/2026/6c173090-0a9d-75b5-d457-88462f1c8b92.htm

---

| Built In Failures MEPFabrication Failures Fabrication Part Invalid Insulation Specification Warning Property |
| --- |

The insulation specification is invalid for the pinned fabrication part.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId FabricationPartInvalidInsulationSpecificationWarning { get; }
```

```
Public Shared ReadOnly Property FabricationPartInvalidInsulationSpecificationWarning As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ FabricationPartInvalidInsulationSpecificationWarning {
	FailureDefinitionId^ get ();
}
```

```
static member FabricationPartInvalidInsulationSpecificationWarning : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures MEPFabricationFailures Class Autodesk.Revit.DB Namespace